Autodesk.Revit.DB.AssemblyInstance.RemoveMemberIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Removes member element ids from the assembly instance.
memberIds:
Element ids to be removed from the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the assembly instance.
Provided set should not be empty and all elements should be a member of the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AddMemberIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Adds member element ids for the assembly instance.
memberIds:
Element ids to be added to the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for membership in the assembly instance.
Elements should be of a valid category and should not be a member of an existing assembly.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.SetMemberIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets member element ids for the assembly instance. All existing members are cleared.
memberIds:
Element ids to set for the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.IsValidNamingCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if the naming category is valid for an assembly instance.
document:
The document for the assembly instance.
namingCategoryId:
The id of the naming category for the assembly instance.
assemblyMemberIds:
Member ids to check validity of naming category
Returns:
True if the naming category is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.CanRemoveElementsFromAssembly(Autodesk.Revit.DB.AssemblyInstance,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if provided assembly members can be removed from the assembly instance.
assemblyInstance:
The assembly instance to remove elements from.
memberIds:
Element ids to be tested for validity to remove from the assembly instance.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AreElementsValidForAssembly(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Identifies if provided assembly members are valid.
document:
The document.
assemblyMemberIds:
Element ids to be tested for validity for membership of an assembly instance.
assemblyId:
Id of the existing assembly to add components to. If invalid, the method return whether the components can be added to a new assembly
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Creates a new assembly instance.
Remarks:
Transaction must be committed after calling this method before performing any action on the newly created instance.
Assembly type is assigned after the transaction for creating assembly instance is complete.
document:
The document containing the elements.
assemblyMemberIds:
The elements that comprise the assembly.
namingCategoryId:
The naming category for the assembly instance.
Returns:
The newly created assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for membership in the assembly instance.
Elements should be of a valid category and should not be a member of an existing assembly.
-or-
This naming category was not valid for an assembly instance containing the proposed members.
The naming category should match one of the member element categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012